//Модуль 1. Заняття 2. Розгалуження. Цикли
// //Example 1 - Введення користувача та розгалуження
// //Використовуючи конструкцію if..else та prompt, напиши код, який питатиме:
// //"Яка офіційна назва JavaScript?".Якщо користувач вводить ECMAScript,
// //    то показуй alert з рядком "Правильно!", в іншому випадку
// //        - "Не знаєте? ECMAScript!"

// const question = "Яка офіційна назва JavaScript?";
// const correctAnswer = "ECMAScript";
// const otherAnwer = "ECMAScript";
// let msg = "";

// if (correctAnswer === otherAnwer) {
//   msg = "Правильно!";
// } else {
//   msg = "Не знаєте? ECMAScript!";
// }
// console.log(msg);

// if (correctAnswer === otherAnwer) msg = "Правильно!";
// else msg = "Не знаєте? ECMAScript!";
// console.log(msg);

// msg = correctAnswer === otherAnwer ? "Правильно!" : "Не знаєте? ECMAScript!";
// console.log(msg);

// ---------------------------------------------------------------------------------------------------------------------------------

// //"Example 2 - Відображення часу (if...else)
// //"Напиши скрипт для відображення годин та хвилин у консолі браузера у вигляді рядка формату "14 г. 26 хв.". Якщо значення змінної minutes дорівнює 0, то виводь рядок "14 г.", без хвилин.

// const hours = 14;
// const minutes = 0;
// let timestring;

// if (minutes > 0) {
//   timestring = `${hours} г. ${minutes} хв.`;
// } else {
//   timestring = `${hours} г.`;
// }
// console.log(timestring);

// ---------------------------------------------------------------------------------------------------------------------------------

// Example 3 - Розгалуження
// Напиши скрипт, який виводить у консоль рядок "Це позитивне число", якщо у prompt користувач ввів число більше нуля. Якщо було введено нуль, виводь в консоль рядок "Це нуль". Якщо передали від'ємне число, у консолі повинен бути рядок "Це негативне число".

// const userInput = prompt("Введіть число");
// let msg1 = "";

// if (userInput > 0) {
//   msg1 = "Це позитивне число";
// } else if (userInput === 0) {
//   msg1 = "Це нуль";
// } else {
//   00;
//   msg1 = "Це негативне число";
// }
// console.log(msg1);

// ---------------------------------------------------------------------------------------------------------------------------------

// Example 4 - Вкладені розгалуження
// Напиши скрипт, який порівнює числа у змінних a та b.
// Якщо обидва значення більше 100, то виведи в консоль максимальне з них.
// // В протилежному випадку у консолі повинна бути сума значення b та числа 512.

// const a = 170;
// const b = 110;
// const c = 512;

// // if (a > 100 && b > 100) {
// //   console.log(Math.max(a, b));
// // } else {
// //   console.log(b + c);
// // }s
// const result = a > 100 && b > 100 ? Math.max(a, b) : b + c;
// console.log(result);

// ---------------------------------------------------------------------------------------------------------------------------------

// // Example 5 - Форматирование ссылки (endsWith)
// // Напиши скрипт который проверяет заканчивается ли значение переменной link символом /.
// // Если нет, добавь в конец значения link этот символ.Используй конструкцию if...else.

// let link = "https://my-site.com/about";

// // if (!link.endsWith("/")) {
// //   link = link + "/";
// // }
// // console.log(link);

// const linkUpd = !link.endsWith("/") ? link + "/" : console.log(link);
// console.log(linkUpd);

// ---------------------------------------------------------------------------------------------------------------------------------

// Example 6 - Методы строк и чейнинг
// Напиши скрипт который рассчитывает индекс массы тела человека. Для этого необходимо разделить вес в киллограммах на квадрат высоты человека в метрах.

// Вес и высота хранятся в переменных weight и height, но не как числа, а в виде строк(специально для задачи).Нецелые числа могут быть заданы в виде 24.7 или 24, 7
// , то есть в качестве разделителя дробной части может быть запятая.
// Индекс массиы тела необходимо округлить до одной цифры после запятой;

// let weight = "88,3";
// let height = "1.75";

// const bmi = Number(
//   (
//     Number(weight.replace(",", ".")) /
//     (Number(height.replace(",", ".")) * Number(height.replace(",", ".")))
//   ).toFixed(1)
// );
// const bmi2 = Number(
//   (
//     Number(weight.replace(",", ".")) / Number(height.replace(",", ".") ** 2)
//   ).toFixed(1)
// );
// const bmi3 = Number(
//   (Number(weight.replace(",", ".")) / Math.pow(height, 2)).toFixed(1)
// );

// console.log(bmi); // 28.8
// console.log(bmi2); // 28.8
// console.log(bmi3); // 28.8

// ---------------------------------------------------------------------------------------------------------------------------------

// Example 6 - Форматирование ссылки (includes и логическое «И»)
// Напиши скрипт который проверяет заканчивается ли значение переменной link символом /.
// Если нет, добавь в конец значения link этот символ, но только в том случае, если в link есть подстрока "my-site".Используй конструкцию if...else.

let link = "https://somesite.com/about";
// Пиши код ниже этой строки

// Пиши код выше этой строки
console.log(link);
